{"id": "seed-1", "user": "Explain what QLoRA is in simple terms.", "assistant": "QLoRA is a way to fine-tune a big language model using much less memory. Instead of updating all the model's weights, it keeps the original model frozen and adds a small set of extra weights (LoRA adapters). These adapters are trained in 4-bit compressed form, so you can run training on a single consumer GPU. The end result is that you get a model specialized for your task, but you avoid the huge cost of full fine-tuning.", "tags": ["ml", "qlora"]}
{"id": "seed-2", "user": "Give me a simple but clear daily study plan for math and science for 2 weeks.", "assistant": "Here is a simple, realistic plan:\\n\\n**Assumptions**\\n- You have about 2 hours per day.\\n- You are revising basic algebra, geometry, and general science.\\n\\n**Week 1**\\n- Day 1-2: Algebra review (equations, inequalities). 60 min practice + 30 min checking mistakes.\\n- Day 3-4: Geometry (angles, area, perimeter). 60 min examples + 30 min practice.\\n- Day 5: Science recap (key definitions, diagrams). 90 min reading + 30 min flashcards.\\n- Day 6-7: Mixed practice from past papers. 2 x 60 min sessions.\\n\\n**Week 2**\\n- Day 8-10: Timed practice papers (1 hour) + 30 min review.\\n- Day 11-13: Focus only on topics you got wrong. Short, targeted sessions (90 min).\\n- Day 14: Light recap, sleep early. No heavy new topics.\\n\\nKeep each session focused, remove your phone, and always review mistakes instead of just doing more questions.", "tags": ["study", "planning"]}
{"id": "seed-3", "user": "Help me design a simple wave-based enemy system for a Roblox tower defense game.", "assistant": "Here is a simple structure for a wave-based enemy system:\\n\\n1. **Data structure for waves**\\n   - Create a ModuleScript that defines all waves as a list.\\n   - Each wave entry contains: enemy type, count, spawn rate, and optional modifiers.\\n\\n2. **Wave controller**\\n   - Server script that reads the current wave from the module.\\n   - Spawns enemies at intervals until the count for that wave is reached.\\n   - When all enemies in a wave are dead, start a short delay, then trigger the next wave.\\n\\n3. **Difficulty scaling**\\n   - Increase enemy health and speed slightly each wave.\\n   - Every few waves, introduce a new enemy type with a special ability (e.g., fas
